Repository: Ola-jed/todolist
Catalog: lib/l10n/app_*.arb
Languages: fr

source: Name
fr: Nom

# nameRequired
source: The name field is required
fr: Le champ nom est obligatoire

# emailRequired
source: The email field is required
fr: Le champ email est obligatoire

source: Invalid email format
fr: Format d'email invalide

# passwordRequired
source: The password field is required
fr: Le champ mot de passe est obligatoire

source: Password
fr: Mot de passe

source: Signup failed
fr: Echec de l'inscription

source: Sign up
fr: Inscription

# alreadyRegistered
source: Already registered ? Sign in
fr: Déjà inscrit ? Connectez vous

source: Sign in
fr: Connexion

source: Signin failed
fr: Echec de la connexion

# notYetRegistered
source: Not yet registered ? Sign up
fr: Pas de compte ? Inscrivez-vous

source: Forgotten password ?
fr: Mot de passe oublié ?

# enterEmail
source: Enter your email
fr: Entrez votre addresse mail

source: Reset password
fr: Réinitialisation du mot de passe

source: Password reset
fr: Réinitialisation du mot de passe

# resetPasswordQuestion
source: Do you want to reset your password ?
fr: Voulez-vous réinitialiser votre mot de passe ?

# emailSentToYou
source: An email have been sent to you
fr: Un courriel vous a été envoyé

# anErrorOccurred
source: An error occurred during the process
fr: Une erreur est survenue

source: Yes
fr: Oui

source: No
fr: Non

source: Task
fr: Tâche

source: Title
fr: Titre

# titleRequired
source: The title field is required
fr: Le champ titre est obligatoire

# descriptionRequired
source: The description field is required
fr: Le champ description est obligatoire

source: Date limit
fr: Date limite

# dateLimitRequired
source: The date limit field is required
fr: le champ date limite est obligatoire

source: Priority
fr: Priorité

# priorityRequired
source: The priority field is required
fr: Le champ priorité est obligatoire

source: Has steps ?
fr: Possède des étapes ?

source: Task creation
fr: Création de la taĉhe

source: Task update
fr: Modification de la tâche

source: Create task
fr: Créer la tâche

source: Update task
fr: Modifier la tâche

# couldNotCreateTask
source: Could not create the task
fr: Echec de la création de la tâche

# couldNotUpdateTask
source: Could not update the task
fr: Echec de la modification de la tâche

source: Step
fr: Etape

source: Step creation
fr: Création de l'étape

# couldNotCreateOrUpdateStep
source: Could not create/update the task step
fr: Echec lors de l'nregistrement de l'étape

source: Update step
fr: Modifier l'étape

source: Create step
fr: Créer l'étape

source: No task
fr: Aucune tâche

source: Delete task ?
fr: Supprimer la tâche ?

# deleteTaskQuestion
source: Do you want to delete this task ?
fr: Voulez-vous supprimer cette tâche ?

source: Task deletion
fr: Suppression de la tâche

source: Could not delete task
fr: Impossible de supprimer la tâche

source: Finished
fr: Terminée

source: Home
fr: Accueil

source: Account
fr: Compte

source: About
fr: À propos

source: Logout
fr: Déconnexion

# logoutQuestion
source: Do you really want to logout ?
fr: Voulez vous vraiment vous déconnecter ?

source: Could not logout
fr: Déconnexion impossible

source: Could not update step
fr: Impossible de modifier l'étape

source: Step deletion
fr: Suppression de l'étape

source: Could not delete step
fr: Impossible de supprimer l'étape

# enterPassword
source: Enter your password
fr: Entrez votre mot de passe

# newPassword
source: New password (facultative)
fr: Nouveau mot de passe (facultatif)

source: Danger zone
fr: Zone de danger

source: Update account ?
fr: Modification de compte ?

# updateAccountDeclarative
source: Update account
fr: Modifier mon compte

# updateAccountQuestion
source: Do you want to update your account ?
fr: Voulez vous modifier votre compte ?

source: Account update failed
fr: Échec de la modification du compte

source: Delete account ?
fr: Supprimer mon compte ?

# deleteAccountQuestion
source: Do you really want to delete your account ?
fr: Voulez vous vraiment supprimer votre compte ?

# deleteAccountDeclarative
source: Delete account
fr: Supprimer mon compte

source: Account deletion failed
fr: Échec de la suppression du compte

# taskDoesNotHaveSteps
source: This task does not have steps
fr: Cette taĉhe ne comporte pas d'étapes

source: No step found
fr: Aucune étape trouvée

source: Define reminder
fr: Définir un rappel

source: Reminder defined
fr: Rappel défini

source: Could not define reminder
fr: Impossible de définir le rappel
